{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In this notebook I will apply some basic content based and collaborative filtering methods. The goal is to mimic some of the Netflix recommender algorithms described in [1]. The Neo4j sandbox project \"Recommendation\" shows handy examples of how content based as well as collaborativ filtering can be applyed on to the MovieLens dataset [2].\n",
    "\n",
    "The netflix recommendation system consists of multiple algorithms. Each is designed to serve a dedicated use casse. All algorithms together create the netflix expierence according to [1]. The collection of netflix recommender algorithms consists mainly of:\n",
    "- Personalized Video Ranger: PVR\n",
    "- Top-N Video Ranker\n",
    "- Trending Now\n",
    "- Contiunue Watching\n",
    "- Video-Video Similarity\n",
    "- Page Generation: Row Selection and Ranking\n",
    "- Search algorithms\n",
    "\n",
    "In this notebook we are focusing on the PVR, Top-N Ranker as well as Trending Now.\n",
    "\n",
    "- [1] *Carlos A. Gomez-Uribe and Neil Hunt. 2015. The Netflix recommender system: Algorithms, business value, and innovation. ACM Trans. Manage. Inf. Syst. 6, 4, Article 13 (December 2015), 19 pages. DOI: http://dx.doi.org/10.1145/2843948*\n",
    "- [2] *https://sandbox.neo4j.com/*"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "from matplotlib import pyplot as plt\n",
    "# from skimage import io\n",
    "\n",
    "from neo4_connection import USER, PWD, URL\n",
    "\n",
    "import warnings\n",
    "warnings.filterwarnings('ignore')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri=URL, auth=(USER, PWD))\n",
    "\n",
    "def fetch_data(query):\n",
    "  with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    return pd.DataFrame([r.values() for r in result], columns=result.keys())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Personalized Video Ranker (PVR)\n",
    "\n",
    "PVR recommendation categories could be for example:\n",
    "- Action Movies\n",
    "- Because you watched XYZ\n",
    "- Top Picks for User ABC\n",
    "- Popular on Netflix\n",
    "- ect. \n",
    "\n",
    "In the following section we try to mimic some of these categories by simply using Cypher queries. The entry point for the queries is always a user and optionally a date."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def plot_netflix_style(df:pd.DataFrame, n_cols:int=8) -> None:\n",
    "    _, ax = plt.subplots(nrows=1, ncols=n_cols, figsize=(18, 3))\n",
    "\n",
    "    for i, (idx, row) in enumerate(df.iterrows()):\n",
    "        #ax[i].set_title(row['title'])\n",
    "        if row['imgUri'] is not None:\n",
    "            img = io.imread(row['imgUri'])\n",
    "            ax[i].imshow(img)\n",
    "\n",
    "        if i == n_cols -1:\n",
    "            break\n",
    "\n",
    "    plt.axis('off')\n",
    "    plt.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Content-based Approaches"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Example: Action Movies\n",
    "\n",
    "Here we start at a dedicated genre, e.g. Action. We then look for movies within the same genre and filter out movies with bad ratings. The query returns a list of n movies ordered by the amount of \"good\" ratings and the imdbRating score. This is a simple approach of how we can apply content based filtering by genres. We recommend the users x who likes genre Action other action movies. And we sort them by popularity. These recommendations are not very personalized, for each user who likes the genre Action the recommendation list will look the same."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Action movies\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>title</th>\n",
       "      <th>numOfRatings</th>\n",
       "      <th>ratingScore</th>\n",
       "      <th>imdbRating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>260</td>\n",
       "      <td>Star Wars: Episode IV - A New Hope</td>\n",
       "      <td>43</td>\n",
       "      <td>194</td>\n",
       "      <td>8.7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>39</td>\n",
       "      <td>180</td>\n",
       "      <td>8.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2571</td>\n",
       "      <td>Matrix, The</td>\n",
       "      <td>39</td>\n",
       "      <td>180</td>\n",
       "      <td>8.7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2959</td>\n",
       "      <td>Fight Club</td>\n",
       "      <td>36</td>\n",
       "      <td>163</td>\n",
       "      <td>8.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1196</td>\n",
       "      <td>Star Wars: Episode V - The Empire Strikes Back</td>\n",
       "      <td>34</td>\n",
       "      <td>160</td>\n",
       "      <td>8.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>58559</td>\n",
       "      <td>Dark Knight, The</td>\n",
       "      <td>33</td>\n",
       "      <td>153</td>\n",
       "      <td>9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>7153</td>\n",
       "      <td>Lord of the Rings: The Return of the King, The</td>\n",
       "      <td>33</td>\n",
       "      <td>149</td>\n",
       "      <td>8.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1198</td>\n",
       "      <td>Raiders of the Lost Ark (Indiana Jones and the...</td>\n",
       "      <td>31</td>\n",
       "      <td>140</td>\n",
       "      <td>8.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1210</td>\n",
       "      <td>Star Wars: Episode VI - Return of the Jedi</td>\n",
       "      <td>28</td>\n",
       "      <td>127</td>\n",
       "      <td>8.4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>112852</td>\n",
       "      <td>Guardians of the Galaxy</td>\n",
       "      <td>23</td>\n",
       "      <td>103</td>\n",
       "      <td>8.1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId                                              title  numOfRatings  \\\n",
       "0      260                 Star Wars: Episode IV - A New Hope            43   \n",
       "1    79132                                          Inception            39   \n",
       "2     2571                                        Matrix, The            39   \n",
       "3     2959                                         Fight Club            36   \n",
       "4     1196     Star Wars: Episode V - The Empire Strikes Back            34   \n",
       "5    58559                                   Dark Knight, The            33   \n",
       "6     7153     Lord of the Rings: The Return of the King, The            33   \n",
       "7     1198  Raiders of the Lost Ark (Indiana Jones and the...            31   \n",
       "8     1210         Star Wars: Episode VI - Return of the Jedi            28   \n",
       "9   112852                            Guardians of the Galaxy            23   \n",
       "\n",
       "   ratingScore  imdbRating  \n",
       "0          194         8.7  \n",
       "1          180         8.8  \n",
       "2          180         8.7  \n",
       "3          163         8.9  \n",
       "4          160         8.8  \n",
       "5          153         9.0  \n",
       "6          149         8.9  \n",
       "7          140         8.5  \n",
       "8          127         8.4  \n",
       "9          103         8.1  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "genre = 'Action'\n",
    "limit = 10\n",
    "query = f\"\"\"\n",
    "MATCH (g:Genre) <-[:IN_GENRE]- (m:Movie)\n",
    "    <-[r:RATED]- (u:User)\n",
    "WHERE g.name = '{genre}'\n",
    "AND r.rating >= 4.0\n",
    "AND m.imdbRating >= 8.0\n",
    "AND r.ratingTs.year >= 2015\n",
    "WITH g, m, count(r.rating) as numOfRatings, sum(r.rating) as ratingScore\n",
    "\n",
    "RETURN m.movieId AS movieId, \n",
    "    m.title AS title, \n",
    "    numOfRatings, \n",
    "    toInteger(ratingScore) AS ratingScore, \n",
    "    m.imdbRating AS imdbRating\n",
    "    //m.poster as imgUri\n",
    "ORDER BY ratingScore DESC, imdbRating DESC\n",
    "LIMIT {limit}\n",
    "\"\"\"\n",
    "\n",
    "dfs = []\n",
    "df = fetch_data(query)\n",
    "df.dropna(axis=0, inplace=True)\n",
    "dfs.append(df)\n",
    "\n",
    "print(f\"{genre} movies\")\n",
    "df.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Example \"Because you watched ...\"\n",
    "\n",
    "Here we start at a dedicated movie, e.g. Inception. We then look for other movies with the at least one common genre. The query returns a list of n movies ordered by its similarity regarding common genres. This is a simple approach of how we can apply content based filtering by recommending movies based on rated movies. These recommendations are not personalized, the list of recommended movies looks identical for each user."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Because you have watched Inception\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>watchedId</th>\n",
       "      <th>watchedTitle</th>\n",
       "      <th>recId</th>\n",
       "      <th>recTitle</th>\n",
       "      <th>commonGenres</th>\n",
       "      <th>num_of_commonGenres</th>\n",
       "      <th>imdbScore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>60684</td>\n",
       "      <td>Watchmen</td>\n",
       "      <td>[Drama, Mystery, Sci-Fi, Thriller, IMAX, Action]</td>\n",
       "      <td>6</td>\n",
       "      <td>2812919.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>198</td>\n",
       "      <td>Strange Days</td>\n",
       "      <td>[Crime, Drama, Mystery, Sci-Fi, Thriller, Action]</td>\n",
       "      <td>6</td>\n",
       "      <td>380001.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>26701</td>\n",
       "      <td>Patlabor: The Movie (Kidô keisatsu patorebâ: T...</td>\n",
       "      <td>[Crime, Drama, Mystery, Sci-Fi, Thriller, Action]</td>\n",
       "      <td>6</td>\n",
       "      <td>23126.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>5445</td>\n",
       "      <td>Minority Report</td>\n",
       "      <td>[Crime, Mystery, Sci-Fi, Thriller, Action]</td>\n",
       "      <td>5</td>\n",
       "      <td>2985382.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>85414</td>\n",
       "      <td>Source Code</td>\n",
       "      <td>[Drama, Mystery, Sci-Fi, Thriller, Action]</td>\n",
       "      <td>5</td>\n",
       "      <td>2730802.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>86644</td>\n",
       "      <td>Fast Five (Fast and the Furious 5, The)</td>\n",
       "      <td>[Crime, Drama, Thriller, IMAX, Action]</td>\n",
       "      <td>5</td>\n",
       "      <td>2012967.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>7445</td>\n",
       "      <td>Man on Fire</td>\n",
       "      <td>[Crime, Drama, Mystery, Thriller, Action]</td>\n",
       "      <td>5</td>\n",
       "      <td>1993576.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>5388</td>\n",
       "      <td>Insomnia</td>\n",
       "      <td>[Crime, Drama, Mystery, Thriller, Action]</td>\n",
       "      <td>5</td>\n",
       "      <td>1531620.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>79132</td>\n",
       "      <td>Inception</td>\n",
       "      <td>2985</td>\n",
       "      <td>RoboCop</td>\n",
       "      <td>[Crime, Drama, Sci-Fi, Thriller, Action]</td>\n",
       "      <td>5</td>\n",
       "      <td>1309012.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   watchedId watchedTitle  recId  \\\n",
       "0      79132    Inception  60684   \n",
       "1      79132    Inception    198   \n",
       "2      79132    Inception  26701   \n",
       "4      79132    Inception   5445   \n",
       "5      79132    Inception  85414   \n",
       "6      79132    Inception  86644   \n",
       "7      79132    Inception   7445   \n",
       "8      79132    Inception   5388   \n",
       "9      79132    Inception   2985   \n",
       "\n",
       "                                            recTitle  \\\n",
       "0                                           Watchmen   \n",
       "1                                       Strange Days   \n",
       "2  Patlabor: The Movie (Kidô keisatsu patorebâ: T...   \n",
       "4                                    Minority Report   \n",
       "5                                        Source Code   \n",
       "6            Fast Five (Fast and the Furious 5, The)   \n",
       "7                                        Man on Fire   \n",
       "8                                           Insomnia   \n",
       "9                                            RoboCop   \n",
       "\n",
       "                                        commonGenres  num_of_commonGenres  \\\n",
       "0   [Drama, Mystery, Sci-Fi, Thriller, IMAX, Action]                    6   \n",
       "1  [Crime, Drama, Mystery, Sci-Fi, Thriller, Action]                    6   \n",
       "2  [Crime, Drama, Mystery, Sci-Fi, Thriller, Action]                    6   \n",
       "4         [Crime, Mystery, Sci-Fi, Thriller, Action]                    5   \n",
       "5         [Drama, Mystery, Sci-Fi, Thriller, Action]                    5   \n",
       "6             [Crime, Drama, Thriller, IMAX, Action]                    5   \n",
       "7          [Crime, Drama, Mystery, Thriller, Action]                    5   \n",
       "8          [Crime, Drama, Mystery, Thriller, Action]                    5   \n",
       "9           [Crime, Drama, Sci-Fi, Thriller, Action]                    5   \n",
       "\n",
       "   imdbScore  \n",
       "0  2812919.0  \n",
       "1   380001.0  \n",
       "2    23126.0  \n",
       "4  2985382.0  \n",
       "5  2730802.0  \n",
       "6  2012967.0  \n",
       "7  1993576.0  \n",
       "8  1531620.0  \n",
       "9  1309012.0  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movie_id = 79132\n",
    "limit = 10\n",
    "query = f\"\"\"\n",
    "// Find similar movies by common genres\n",
    "MATCH (m:Movie)-[:IN_GENRE]->(g:Genre)\n",
    "              <-[:IN_GENRE]-(rec:Movie)\n",
    "WHERE m.movieId = {movie_id}\n",
    "WITH m, rec, collect(g.name) AS commonGenres, count(*) AS num_of_commonGenres\n",
    "RETURN m.movieId AS watchedId,\n",
    "    m.title AS watchedTitle,\n",
    "    rec.movieId AS recId,\n",
    "    rec.title AS recTitle, \n",
    "    commonGenres, \n",
    "    num_of_commonGenres,\n",
    "    toInteger(rec.imdbRating * rec.imdbVotes) AS imdbScore \n",
    "    //,rec.poster as imgUri\n",
    "ORDER BY num_of_commonGenres DESC, imdbScore DESC \n",
    "LIMIT {limit}\n",
    "\"\"\"\n",
    "\n",
    "df = fetch_data(query)\n",
    "df.dropna(axis=0, inplace=True)\n",
    "dfs.append(df)\n",
    "\n",
    "print(f\"Because you have watched {df.loc[0, 'watchedTitle']}\")\n",
    "df.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Example This week popular on MovieLens\n",
    "\n",
    "Here we look at the most popular movies within a timeinterval, e.g. current week. The query returns a list of n movies ordered by popularity wihtin the timeinterval. These recommendations are not personalized, the list of recommended movies looks identical for each user."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "This week most popular movies\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>movie</th>\n",
       "      <th>trendScore</th>\n",
       "      <th>imdbVotes</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>608</td>\n",
       "      <td>Fargo</td>\n",
       "      <td>38.0</td>\n",
       "      <td>435149</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>527</td>\n",
       "      <td>Schindler's List</td>\n",
       "      <td>35.5</td>\n",
       "      <td>828323</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>356</td>\n",
       "      <td>Forrest Gump</td>\n",
       "      <td>34.0</td>\n",
       "      <td>1184397</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>318</td>\n",
       "      <td>Shawshank Redemption, The</td>\n",
       "      <td>33.5</td>\n",
       "      <td>1626900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1198</td>\n",
       "      <td>Raiders of the Lost Ark (Indiana Jones and the...</td>\n",
       "      <td>28.5</td>\n",
       "      <td>632840</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1265</td>\n",
       "      <td>Groundhog Day</td>\n",
       "      <td>28.5</td>\n",
       "      <td>418699</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>296</td>\n",
       "      <td>Pulp Fiction</td>\n",
       "      <td>28.0</td>\n",
       "      <td>1268850</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>25</td>\n",
       "      <td>Leaving Las Vegas</td>\n",
       "      <td>26.0</td>\n",
       "      <td>91469</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>260</td>\n",
       "      <td>Star Wars: Episode IV - A New Hope</td>\n",
       "      <td>25.5</td>\n",
       "      <td>875151</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>593</td>\n",
       "      <td>Silence of the Lambs, The</td>\n",
       "      <td>25.5</td>\n",
       "      <td>847200</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId                                              movie  trendScore  \\\n",
       "0      608                                              Fargo        38.0   \n",
       "1      527                                   Schindler's List        35.5   \n",
       "2      356                                       Forrest Gump        34.0   \n",
       "3      318                          Shawshank Redemption, The        33.5   \n",
       "4     1198  Raiders of the Lost Ark (Indiana Jones and the...        28.5   \n",
       "5     1265                                      Groundhog Day        28.5   \n",
       "6      296                                       Pulp Fiction        28.0   \n",
       "7       25                                  Leaving Las Vegas        26.0   \n",
       "8      260                 Star Wars: Episode IV - A New Hope        25.5   \n",
       "9      593                          Silence of the Lambs, The        25.5   \n",
       "\n",
       "   imdbVotes  \n",
       "0     435149  \n",
       "1     828323  \n",
       "2    1184397  \n",
       "3    1626900  \n",
       "4     632840  \n",
       "5     418699  \n",
       "6    1268850  \n",
       "7      91469  \n",
       "8     875151  \n",
       "9     847200  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_date = \"2016-10-16\"\n",
    "limit = 10\n",
    "query = f\"\"\"\n",
    "MATCH (u:User) -[r:RATED]-> (m:Movie)\n",
    "WHERE date(r.ratingTs).week = date(\"{query_date}\").week\n",
    "WITH m, sum(r.rating) AS trendScore\n",
    "RETURN m.movieId AS movieId, \n",
    "    m.title AS movie, \n",
    "    trendScore,\n",
    "    m.imdbVotes AS imdbVotes\n",
    "    //,m.poster as imgUri\n",
    "ORDER BY trendScore DESC, m.imdbVotes DESC\n",
    "LIMIT {limit}\n",
    "\"\"\"\n",
    "\n",
    "df = fetch_data(query)\n",
    "df.dropna(axis=0, inplace=True)\n",
    "dfs.append(df)\n",
    "\n",
    "print(f\"This week most popular movies\")\n",
    "df.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Collaborative approches"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Top picks for Cynthia Freeman\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>title</th>\n",
       "      <th>ratingScore</th>\n",
       "      <th>recommendingPeers</th>\n",
       "      <th>genres</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>92259</td>\n",
       "      <td>Intouchables</td>\n",
       "      <td>27.5</td>\n",
       "      <td>[Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...</td>\n",
       "      <td>[Drama, Comedy]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>4973</td>\n",
       "      <td>Amelie (Fabuleux destin d'Amélie Poulain, Le)</td>\n",
       "      <td>26.5</td>\n",
       "      <td>[Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...</td>\n",
       "      <td>[Comedy, Romance]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>296</td>\n",
       "      <td>Pulp Fiction</td>\n",
       "      <td>26.0</td>\n",
       "      <td>[Jonathan Cooper, Kenneth Snyder MD, Andrew Fr...</td>\n",
       "      <td>[Drama, Crime, Comedy, Thriller]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4306</td>\n",
       "      <td>Shrek</td>\n",
       "      <td>25.5</td>\n",
       "      <td>[Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...</td>\n",
       "      <td>[Romance, Fantasy, Comedy, Children, Animation...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2571</td>\n",
       "      <td>Matrix, The</td>\n",
       "      <td>25.5</td>\n",
       "      <td>[Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...</td>\n",
       "      <td>[Thriller, Sci-Fi, Action]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>260</td>\n",
       "      <td>Star Wars: Episode IV - A New Hope</td>\n",
       "      <td>24.0</td>\n",
       "      <td>[Kenneth Snyder MD, Manuel Morris, Andrew Free...</td>\n",
       "      <td>[Sci-Fi, Action, Adventure]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1196</td>\n",
       "      <td>Star Wars: Episode V - The Empire Strikes Back</td>\n",
       "      <td>24.0</td>\n",
       "      <td>[Jonathan Cooper, Kenneth Snyder MD, Andrew Fr...</td>\n",
       "      <td>[Action, Adventure, Sci-Fi]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>5952</td>\n",
       "      <td>Lord of the Rings: The Two Towers, The</td>\n",
       "      <td>23.5</td>\n",
       "      <td>[Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...</td>\n",
       "      <td>[Adventure, Fantasy]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>7147</td>\n",
       "      <td>Big Fish</td>\n",
       "      <td>23.0</td>\n",
       "      <td>[Kenneth Snyder MD, Manuel Morris, Andrew Free...</td>\n",
       "      <td>[Romance, Fantasy, Drama]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>7361</td>\n",
       "      <td>Eternal Sunshine of the Spotless Mind</td>\n",
       "      <td>22.0</td>\n",
       "      <td>[Kenneth Snyder MD, Manuel Morris, Andrew Free...</td>\n",
       "      <td>[Drama, Sci-Fi, Romance]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId                                           title  ratingScore  \\\n",
       "0    92259                                    Intouchables         27.5   \n",
       "1     4973   Amelie (Fabuleux destin d'Amélie Poulain, Le)         26.5   \n",
       "2      296                                    Pulp Fiction         26.0   \n",
       "3     4306                                           Shrek         25.5   \n",
       "4     2571                                     Matrix, The         25.5   \n",
       "5      260              Star Wars: Episode IV - A New Hope         24.0   \n",
       "6     1196  Star Wars: Episode V - The Empire Strikes Back         24.0   \n",
       "7     5952          Lord of the Rings: The Two Towers, The         23.5   \n",
       "8     7147                                        Big Fish         23.0   \n",
       "9     7361           Eternal Sunshine of the Spotless Mind         22.0   \n",
       "\n",
       "                                   recommendingPeers  \\\n",
       "0  [Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...   \n",
       "1  [Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...   \n",
       "2  [Jonathan Cooper, Kenneth Snyder MD, Andrew Fr...   \n",
       "3  [Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...   \n",
       "4  [Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...   \n",
       "5  [Kenneth Snyder MD, Manuel Morris, Andrew Free...   \n",
       "6  [Jonathan Cooper, Kenneth Snyder MD, Andrew Fr...   \n",
       "7  [Jonathan Cooper, Kenneth Snyder MD, Manuel Mo...   \n",
       "8  [Kenneth Snyder MD, Manuel Morris, Andrew Free...   \n",
       "9  [Kenneth Snyder MD, Manuel Morris, Andrew Free...   \n",
       "\n",
       "                                              genres  \n",
       "0                                    [Drama, Comedy]  \n",
       "1                                  [Comedy, Romance]  \n",
       "2                   [Drama, Crime, Comedy, Thriller]  \n",
       "3  [Romance, Fantasy, Comedy, Children, Animation...  \n",
       "4                         [Thriller, Sci-Fi, Action]  \n",
       "5                        [Sci-Fi, Action, Adventure]  \n",
       "6                        [Action, Adventure, Sci-Fi]  \n",
       "7                               [Adventure, Fantasy]  \n",
       "8                          [Romance, Fantasy, Drama]  \n",
       "9                           [Drama, Sci-Fi, Romance]  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_id = 600 #389\n",
    "limit = 20\n",
    "query = f\"\"\"\n",
    "// Find most similiar users according to pearson\n",
    "MATCH (p1:User) -[r:RATED]-> (m:Movie)\n",
    "    <-[r2:RATED]-(p2:User)\n",
    "WHERE p1.userId = {user_id} \n",
    "AND p2 <> p1\n",
    "\n",
    "WITH p1, p2, \n",
    "    collect(r.rating) AS p1Ratings, \n",
    "    collect(r2.rating) AS p2Ratings\n",
    "WHERE size(p1Ratings) > 10\n",
    "\n",
    "WITH p1, p2,\n",
    "    gds.similarity.pearson(p1Ratings, p2Ratings) AS pearsonScore,\n",
    "    gds.similarity.cosine(p1Ratings, p2Ratings) AS cosineScore\n",
    "ORDER BY pearsonScore DESC\n",
    "LIMIT 7\n",
    "\n",
    "// Find movies which has been recommended by the peers but not by the user itself \n",
    "MATCH (p2) -[r3:RATED]-> (rec:Movie)\n",
    "WHERE NOT EXISTS {{ (p1)-[:RATED]->(rec) }}\n",
    "WITH p1, p2, r3, rec\n",
    "\n",
    "// Collect the genres in which the recommended movies are\n",
    "MATCH (rec) -[:IN_GENRE]-> (g:Genre)\n",
    "WITH p1, p2, r3, rec,\n",
    "    collect(g.name) AS genres\n",
    "\n",
    "RETURN rec.movieId AS movieId, \n",
    "    rec.title AS title, \n",
    "    sum(r3.rating) AS ratingScore, \n",
    "    collect(p2.name) as recommendingPeers, \n",
    "    genres\n",
    "    //,rec.poster as imgUri\n",
    "ORDER BY ratingScore DESC\n",
    "LIMIT {limit}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df = fetch_data(query)\n",
    "df.dropna(axis=0, inplace=True)\n",
    "dfs.append(df)\n",
    "\n",
    "print(f\"Top picks for Cynthia Freeman\")\n",
    "df.head(10)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.9.0 ('.new_venv': venv)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "b4b86cfc1452e77d9ce278d6e2f06ea7b3cf78c66895cad39e55a1df0fa1f1cb"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
